In [53]:
import pandas as pd

In [54]:
ipl_data=pd.read_excel("All_IPL_Match_Scores_raw.xlsx")

In [55]:
ipl_data.groupby('Year').size()

Year
2008    58
2009    57
2010    60
2011    72
2012    74
2013    76
2014    60
2015    57
dtype: int64

## Medium level Question

"A close match is defined as when either of the following is satisfied:
  (i)   the match is ""Tied"" (captured in Column Q) 
 (ii)  Balls remaining at the end of the match (Column V) < =  3
 (iii) chasing team wins (Column Q) with  <= 1 Wickets remaining (Column R and S)  
 (iv)  chasing team loses (Column Q) by <= 5 runs. (Column R and S)"
Break out year by year how many close matches were played

In [56]:
#create data frame for output
close_match=pd.DataFrame()

In [57]:
#take or operation of all 4 condition of question to get close matches
close_match["No of close matches"]=ipl_data[ ((ipl_data.Win_Type=="wicket") & (ipl_data.Winning_Margin<=1 )) | (ipl_data.Winning_Team=="Tied") | (ipl_data.Balls_Remaining<3)|((ipl_data.Winning_Team=="FirstBatting") & (ipl_data.Winning_Margin<=5))].groupby('Year').size()

In [58]:
close_match

      No of close matches
Year
2008                   26
2009                   29
2010                   27
2011                   30
2012                   44
2013                   37
2014                   28
2015                   38

Q2.For the 4 teams listed, determine which team has won the most percentage of their matches batting first across all IPLs. To do this, compute for each team: 
(i)   A=total number of matches won by the team 
(ii)  B=how many matches they won batting first
Percent won batting first = (B / A) *100

Team	Percent won batting first
Chennai	?
Hyderabad	?
Mumbai	?
Kolkata	?

In [75]:
close_match.to_excel("close_matches.xlsx")

In [59]:
ipl_data["Winner"].value_counts()

Chennai       79
Mumbai        73
Rajasthan     61
Bangalore     60
Kolkata       60
Punjab        57
Hyderabad     51
Delhi         49
Pune          12
Match tied     6
Kochi          6
Name: Winner, dtype: int64

In [60]:
A_csk=ipl_data[ipl_data.Winner=="Chennai"].shape[0]

In [61]:
A_csk

79

In [62]:
B_csk=ipl_data[(ipl_data.Winner=="Chennai") & (ipl_data.Team_Batting_First=="Chennai")].shape[0]
B_csk

45

In [63]:
csk=(B_csk/A_csk)*100
csk

56.9620253164557

In [64]:
A_hdb=ipl_data[ipl_data.Winner=="Hyderabad"].shape[0]
A_hdb

51

In [65]:
B_hdb=ipl_data[(ipl_data.Winner=="Hyderabad") & (ipl_data.Team_Batting_First=="Hyderabad")].shape[0]
B_hdb

31

In [66]:
hdb=(B_hdb/A_hdb)*100
hdb

60.78431372549019

In [67]:
A_kkr=ipl_data[ipl_data.Winner=="Kolkata"].shape[0]
A_kkr

60

In [68]:
B_kkr=ipl_data[(ipl_data.Winner=="Kolkata") & (ipl_data.Team_Batting_First=="Kolkata")].shape[0]
B_kkr

25

In [69]:
kkr=(B_kkr/A_kkr)*100
kkr

41.66666666666667

In [70]:
A_mi=ipl_data[ipl_data.Winner=="Mumbai"].shape[0]
A_mi

73

In [71]:
B_mi=ipl_data[(ipl_data.Winner=="Mumbai") & (ipl_data.Team_Batting_First=="Mumbai")].shape[0]
B_mi

41

In [72]:
mi=(B_mi/A_mi)*100
mi

56.16438356164384

## making dataframe

In [73]:
data = [['Chennai',csk],['Hyderabad',hdb],['Kolkata',kkr],["Mumbai",mi]]
df = pd.DataFrame(data,columns=['Team','bat_fisrt_win%'])
df

        Team  bat_fisrt_win%
0    Chennai       56.962025
1  Hyderabad       60.784314
2    Kolkata       41.666667
3     Mumbai       56.164384

In [74]:
#dataframe is saved to current directory
df.to_excel("bat_first_win.xlsx")

#### complex level questions
Q1.Carefully see columns W to AO and answer following insights
Identify potential "odd" scoring patterns
(a) Identify a match where team batting second had 6 wickets in hand at 15 overs stage with 33 runs to score of last 5 overs….the team still lost.

In [89]:
team=ipl_data[(ipl_data.Winning_Team!="Chasing") &(ipl_data.Bat_Second_15_ov_wkts_lost==4)&((ipl_data.Bat_Second_15_ov_Req_RR)*5==33) ]

In [90]:
team

,Match_Number,Match,Date,Year,Venue,Team_Batting_First,Team_Batting_Second,Bat_First_Runs_Scored,Bat_First_Wickets_Lost,Bat_First_Overs_Consumed,...,Bat_Second_10_ov_score,Bat_Second_10_ov_wkts_lost,Bat_Second_10_ov_Req_RR,Bat_Second_15_ov_score,Bat_Second_15_ov_wkts_lost,Bat_Second_15_ov_Req_RR,Bat_Second_20_ov_score,Bat_Second_20_ov_wkts_lost,Match_Time,Duckworth Lewis Used
342,343,League Match,Apr 17,2013,Pune,Hyderabad,Pune,119,8,20.0,...,65.0,3.0,5.5,87.0,4.0,6.6,NaN,NaN,Afternoon,NaN

In [95]:
d=team["Date"]
d

342    Apr 17
Name: Date, dtype: object

In [97]:
f_bat=team["Team_Batting_First"]
f_bat

342    Hyderabad
Name: Team_Batting_First, dtype: object

In [99]:
s_bat=team["Team_Batting_Second"]
s_bat

342    Pune
Name: Team_Batting_Second, dtype: object

In [101]:
match_summary=pd.DataFrame()

In [104]:
match_summary['Match No']=team["Match_Number"]
match_summary['Teambattingfirst']=team["Team_Batting_First"]
match_summary['Teambattingsecond']=team["Team_Batting_Second"]
match_summary['Date']=team["Date"]

In [105]:
match_summary

     Match No Teambattingfirst Teambattingsecond    Date
342       343        Hyderabad              Pune  Apr 17

In [106]:
match_summary.to_excel("match_summary.xlsx")

Q1.(b)(b) Identify matches where team batting first had only lost 2 wickets at 15 overs stage but then scored less than 25 runs in the last 5 overs!

In [108]:
team1=ipl_data[(ipl_data.Bat_First_15_ov_wkts_lost==2)&((ipl_data.Bat_First_20_ov_score-ipl_data.Bat_First_15_ov_score)<=25) ]
team1

,Match_Number,Match,Date,Year,Venue,Team_Batting_First,Team_Batting_Second,Bat_First_Runs_Scored,Bat_First_Wickets_Lost,Bat_First_Overs_Consumed,...,Bat_Second_10_ov_score,Bat_Second_10_ov_wkts_lost,Bat_Second_10_ov_Req_RR,Bat_Second_15_ov_score,Bat_Second_15_ov_wkts_lost,Bat_Second_15_ov_Req_RR,Bat_Second_20_ov_score,Bat_Second_20_ov_wkts_lost,Match_Time,Duckworth Lewis Used
100,101,League Match,May 14,2009,Durban,Rajasthan,Mumbai,145,7,20.0,...,54.0,3.0,9.2,98.0,5.0,9.6,143.0,10.0,Evening,NaN

In [111]:
match_summary1=pd.DataFrame()
match_summary1['Match No']=team1["Match_Number"]
match_summary1['Teambattingfirst']=team1["Team_Batting_First"]
match_summary1['Teambattingsecond']=team1["Team_Batting_Second"]
match_summary1['Date']=team1["Date"]

In [112]:
match_summary1

     Match No Teambattingfirst Teambattingsecond    Date
100       101        Rajasthan            Mumbai  May 14

In [113]:
match_summary1.to_excel("match_summary1.xlsx")